Repository: dsysme/musar
Catalog: payments/locale/*/LC_MESSAGES/django.po
Languages: he

source: Corporation ID
he: מס. תאגיד

source: The paying corporation
he: התאגיד המשלם

source: Input date
he: תאריך הזנה

source: Created At
he: נוצר ב

source: Created By
he: נוצר על ידי

source: Who is getting this payment
he: המוטב

source: Amount
he: סכום

source: How much money should be paid
he: הסכום לתשלום

source: Description
he: תיאור

source: Short description of the payment. Who? What for?
he: תיאור קצר של התשלום

source: Due Date
he: מועד אחרון לתשלום

source: The date the payment is due
he: מועד אחרון לתשלום

source: Supply Date
he: תאריך אספקה

source: The date the goods or services where delivared
he: תאריך אספקה

source: Order Date
he: מועד הזמנה

source: The date the supply was ordered
he: מועד הזמנה

source: Pay Date
he: מועד פרעון

source: The date the payment was paid
he: מועד פרעון

source: My Home Page
he: הבית שלי

source: Add payment
he: הוסף תשלום
