Repository: dsysme/musar
Catalog: locale/*/LC_MESSAGES/django.po
Languages: he

source: Clear
he: נקה

source: Corporation ID
he: מספר תאגיד

source: Name
he: שם

source: Input date
he: מועד הזנה

source: Created At
he: נוצר ב

source: Created By
he: נוצר על ידי

source: Amount
he: סכום לתשלום

source: Description
he: תיאור

source: Due Date
he: מועד אחרון לתשלום

source: Supply Date
he: מועד אספקה

source: Order Date
he: מועד ביצוע הזמנה

source: Pay Date
he: מועד פרעון

source: Payment
he: תשלום

source: Payments
he: תשלומים

source: Avg. of Extra Credit Days
he: ימי איחור בממוצע

source: Avg. of Credit Days
he: ימי אשראי בממוצע

source: Rating
he: דירוג

source: corporation
he: מספר תאגיד

source: Send Reminder
he: שלח תזכורת

source: Last Reminder
he: תזכורת אחרונה

source: Corporations List
he: רשימת תאגידים

source: Payments From File
he: הוסף תשלומים מקובץ

source: Save All
he: שמור הכל

source: Total
he: סך הכול

source: days
he: ימים

source: My Home Page
he: הבית שלי

source: Add payments file
he: הוסף תשלום מקובץ

source: Add payment
he: הוסף תשלום

source: Extra Credit Payments
he: תשלומים מאחרים

source: Near-due Payments
he: תשלומים קרובים

source: My Corporations
he: התאגידים שלי

source: My Payments
he: התשלומים שלי

source: Send
he: שלח
